titanic datasını okuyunuz(<b>train.csv</b>). Ödevin geri kalanında dataframe gösterimlerini <b>display()</b> fonksiyonunu kullanarak yapınız.<br> Örn: display(titanic_df)

In [3]:
import pandas as pd
import numpy as np
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız

In [4]:
df_titanic = pd.read_csv("Desktop/Ödev/Ödev/train.csv")
display(df_titanic)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Soru 1:

Kazada ölenlerin yaş ortalamasını bulunuz

In [5]:
df_titanic.query("Survived==0").Age.mean()

30.62617924528302

Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [7]:
df_titanic.query("Survived==0").Fare.mean()

10.5

In [10]:
df_titanic.query("Survived==0").Fare.median()

10.5

Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [15]:
df_titanic.query("Survived==0 and Sex== 'male'").Age.mean() #Ölen erkeklerin yaş ortalaması

31.618055555555557

In [17]:
df_titanic.query("Survived==0 and Sex== 'female'").Age.mean() #Ölen kadınların yaş ortalaması

25.046875

Kazada ölen Kadınların yaş ortalamasını bulunuz

# Soru 2:

Kazadan kurtulanların yaş ortalamasını bulunuz

In [20]:
df_titanic.query("Survived==1").Age.mean()

28.343689655172415

Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [23]:
df_titanic.query("Survived==1").Fare.mean()

48.39540760233917

Kazadan kurtulan toplam kişi sayısını bulunuz

In [26]:
df_titanic.Survived.sum()

342

Kazadan kurtulan erkeklerin yaş ortalamasını bulunuz

In [27]:
df_titanic.query("Survived==1 and Sex=='male'").Age.mean() #Kazadan kurtulan erkeklerin yaş ortalaması

27.276021505376345

In [28]:
df_titanic.query("Survived==1 and Sex=='female'").Age.mean() #Kazadan kurtulan kadınların yaş ortalaması

28.84771573604061

Kazadan kurtulan kadınların yaş ortalamasını bulunuz

# Soru 3:

10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [31]:
df_titanic.query("Age<10").Fare.median()

27.0

10 yaşından büyüklerin bilet fiyatlarının medyan değerini bulunuz

In [36]:
df_titanic.query("Age>10").Fare.median()

13.92915

# Soru 5:

1.sınıf, 2.sınıf ve 3.sınıf yolcuların ölüm oranlarını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [331]:
df_titanic.query("Pclass==1").Pclass.sum()

216

In [439]:
df_titanic.query("Pclass==1").Pclass.sum() #1. sınıf yolcuların sayısı

216

In [327]:
df = df_titanic.query("Pclass==1 and Survived==0").Pclass.sum() #1. sınıf yolcuların ölüm sayısı
print("Bu sayı: ",df )

1. sınıf yolcular ikinci ve üçüncü sınıf yolculara oranla daha çok kurtulmuş. Bu da demek oluyor ki, geliri yüksek yolcular gelir seviyesini kullanarak gemiden kaçmayı başarmış ve diğer bir sebep de, konakladıkları alan geminin kaza geçirme lokasyonuna uzak konumlanmış olmasıdır. Bu sayı:  80

In [440]:
df_titanic.query("Pclass==2").Pclass.sum() #2. sınıf yolcuların sayısı

368

In [100]:
df = df_titanic.query("Pclass==2 and Survived==0").Pclass.sum() #2. sınıf yolcuların ölüm sayısı
print("Geliri orta seviyede olan ikinci sınıf yolcuların ölümden kurtulma sayısı birinci sınıfa çok daha yakın. Bu sayı: ", df)

Geliri orta seviyede olan ikinci sınıf yolcuların ölümden kurtulma sayısı birinci sınıfa çok daha yakın. Bu sayı:  194

In [442]:
df_titanic.query("Pclass==3").Pclass.sum() #3. sınıf yolcuların sayısı

1473

In [101]:
df = df_titanic.query("Pclass==3 and Survived==0").Pclass.sum() #3. sınıf yolcuların ölüm sayısı
print("Geliri en düşük olan kısımda ise çok yüksek düzeyde ölüm sayısı bulunmaktadır. Bunun ana sebebinin ise, üçüncü sınıf yolcuların gemi kaza geçirdikten sonra su sızıntısı ile ilk karşılaşan kesim olmasıdır. Bu sayı ise: ", df)

Geliri en düşük olan kısımda ise çok yüksek düzeyde ölüm sayısı bulunmaktadır. Bunun ana sebebinin ise, üçüncü sınıf yolcuların gemi kaza geçirdikten sonra su sızıntısı ile ilk karşılaşan kesim olmasıdır. Bu sayı ise:  1116

In [455]:
df = 100*(df_titanic.query("Pclass==1 and Survived==0").Pclass.sum() / df_titanic.query("Pclass==1").Pclass.sum())
print("Birinci sınıf yolcuların ölüm oranı : % ", df, "\n1. sınıf yolcular ikinci ve üçüncü sınıf yolculara oranla daha çok kurtulmuş. Hatta bu denli büyük bir gemi faciasına oranla neredeyse 3 kişiden bir kişi ölmüş. Bu da demek oluyor ki, geliri yüksek yolcular gelir seviyesini kullanarak gemiden kurtulmayı başarmış ve diğer bir sebep de, konakladıkları alan geminin kaza geçirme lokasyonuna uzak konumlanmış olmasıdır.")

Birinci sınıf yolcuların ölüm oranı : %  37.03703703703704
1. sınıf yolcular ikinci ve üçüncü sınıf yolculara oranla daha çok kurtulmuş. Hatta bu denli büyük bir gemi faciasına oranla neredeyse 3 kişiden bir kişi ölmüş. Bu da demek oluyor ki, geliri yüksek yolcular gelir seviyesini kullanarak gemiden kurtulmayı başarmış ve diğer bir sebep de, konakladıkları alan geminin kaza geçirme lokasyonuna uzak konumlanmış olmasıdır.

In [457]:
df = 100*(df_titanic.query("Pclass==2 and Survived==0").Pclass.sum() / df_titanic.query("Pclass==2").Pclass.sum())
print("İkinci sınıf yolcuların ölüm oranı : % ", df, "\n2. sınıf yolcular ise, ne birinci sınıf yolcular kadar yüksek bir yüzdeye sahip ne de üçüncü sınıf yolcular kadar içler acısı bir durumdadır. Neredeyse 2 yolcudan biri hayatta kalmıştır.")

İkinci sınıf yolcuların ölüm oranı : %  52.71739130434783
2. sınıf yolcular ise, ne birinci sınıf yolcular kadar yüksek bir yüzdeye sahip ne de üçüncü sınıf yolcular kadar içler acısı bir durumdadır. Neredeyse 2 yolcudan biri hayatta kalmıştır.

In [459]:
df = 100*(df_titanic.query("Pclass==3 and Survived==0").Pclass.sum() / df_titanic.query("Pclass==3").Pclass.sum())
print("Üçüncü sınıf yolcuların ölüm oranı : % ", df, "\nKazanın en vahim tablosu sanırım üçüncü sınıf yolcular için gerçekleşmiştir. Çünkü neredeyse 4 kişiden 3'ü hayatını \nkaybetmiştir. Bunun en büyük sebeplerinden biri kaldıkları yerin geminin en altında ve ilk su alan bölgesinde olmasıdır. Kaza \n
yaşandığı sırada ilk boğulanlar onlar olmuştur.")

Üçüncü sınıf yolcuların ölüm oranı : %  75.76374745417516
Kazanın en vahim tablosu sanırım üçüncü sınıf yolcular için gerçekleşmiştir. Çünkü neredeyse 4 kişiden 3'ü hayatını
kaybetmiştir. Bunun en büyük sebeplerinden biri kaldıkları yerin geminin en altında ve ilk su alan bölgesinde olmasıdır. Kaza yaşandığı sırada ilk boğulanlar onlar olmuştur.

1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarını karşılaştırınız

In [117]:
df_titanic.query("Pclass==1").Fare.mean() 
#1. sınıf yolcuların bilet fiyatı ortalaması aslında onların kaza anında neden bu kadar yaşadığını gözler önüne sermektedir.

84.15468749999992

In [118]:
df_titanic.query("Pclass==2").Fare.mean()

20.66218315217391

In [119]:
df_titanic.query("Pclass==3").Fare.mean()

13.675550101832997

# Soru 6:

Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [188]:
df_kadın = df_titanic.query("Sex=='female' and Survived==0").Survived.count()
df_erkek = df_titanic.query("Sex=='male' and Survived==0").Survived.count()
df_yuzde = 100*(df_kadın/df_erkek)
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız. 
print("Kazada ölen kadınların ölen erkeklere yüzde: %", df_yuzde, "Burada etkili olan iki parametre var bir tanesi kadınların sayısının erkeklerin sayısına oranla çok daha az olmasıdır. Diğer bir parametre ise, kadınların %74'ünün kurtulmuş olmasıdır. Ancak, gemi batarken gemiden ayrılma sırasının kadınlara verilmiş olması daha kuvvetli bir ihtimaldir.")

Kazada ölen kadınların ölen erkeklere yüzde: % 17.307692307692307 Burada etkili olan iki parametre var bir tanesi kadınların sayısının erkeklerin sayısına oranla çok daha az olmasıdır. Diğer bir parametre ise, kadınların %74'ünün kurtulmuş olmasıdır. Ancak, gemi batarken gemiden ayrılma sırasının kadınlara verilmiş olması daha kuvvetli bir ihtimaldir.

In [174]:
df_titanic.Sex.count()

891

In [464]:
df_kadın_2 = 100*len(df_titanic.query("Sex=='female' and Survived==0"))/len(df_titanic.query("Sex=='female'"))
print("Toplam kadın sayısının kurtulan kadın sayısına oranı: %", df_kadın_2)

Toplam kadın sayısının kurtulan kadın sayısına oranı: % 25.796178343949045

In [466]:
df_erkek_2 = 100*len(df_titanic.query("Sex=='male' and Survived==0")) / len(df_titanic.query("Sex=='male'"))
print("Toplam erkek sayısının kurtulan erkek sayısına oranı: %", df_erkek_2)

Toplam erkek sayısının kurtulan erkek sayısına oranı: % 81.10918544194108

# Soru 7:

Kazada ölen erkeklerin ortalama bilet fiyatı ile kurtulan erkeklerin ortalama bilet fiyatını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [201]:
df_olen_erkek = df_titanic.query("Survived==0 and Sex=='male'").Fare.mean()
df_kurtulan_erkek = df_titanic.query("Survived==1 and Sex=='male'").Fare.mean()
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
print("Kazada ölen erkeklerin maddi geliri kurtulan erkeklerin maddi gelirinden daha azdır. Çünkü ölen erkeklerin kaldığı yer, geminin ilk su alan yeridir. Dolayısıyla, ölen erkekler aynı zamanda düşük sınıflı olarak yolculuk etmiştir. Ölen erkeklerin bilet fiyatı ortalaması: ", df_olen_erkek, ". Kurtulan erkeklerin bilet fiyatı ortalaması: ", df_kurtulan_erkek)

Kazada ölen erkeklerin maddi geliri kurtulan erkeklerin maddi gelirinden daha azdır. Çünkü ölen erkeklerin kaldığı yer, geminin ilk su alan yeridir. Dolayısıyla, ölen erkekler aynı zamanda düşük sınıflı olarak yolculuk etmiştir. Ölen erkeklerin bilet fiyatı ortalaması:  21.960992948717944 . Kurtulan erkeklerin bilet fiyatı ortalaması:  40.82148440366974

# Missing Value Doldurma

Bundan sonraki soruları <b>train_missing.csv</b> datasını kullanarak cevaplayınız.

# Soru 8

Age, Embarked ve Fare değişkenlerini mean/median/mode değerlerini kullanarak değişken tipine uygun olacak şekilde doldurunuz.

In [275]:
df_missing = pd.read_csv("Desktop/Ödev/Ödev/train_missing.csv")
display(df_missing)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

In [317]:
df_missing.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp          170
Parch            0
Ticket           0
Fare            91
Cabin          687
Embarked       173
dtype: int64

## Age'in doldurulması

In [247]:
df_missing.Age.mode()[0] , df_missing.Age.mean(), df_missing.Age.median() 
#Age kolonunu ortalama ile doldurmamız daha doğru sonuçlar verebilir.

(24.0, 29.69911764705882, 28.0)

In [248]:
df_missing.Age.isnull().sum()

177

In [272]:
df_miss = df_missing.copy() #datanın kopyasını alıyoruz.

In [276]:
df_miss.Age = df_miss.Age.fillna(df_miss.Age.mean())

In [277]:
df_miss.Age.isnull().sum()

0

In [278]:
df_miss.Age.mean(), df_missing.Age.mean()

(29.699117647058763, 29.69911764705882)

## Embarked'in Doldurulması

In [301]:
df_miss_1 = df_missing.copy()

In [302]:
df_miss_1.Embarked.isnull().sum()

173

In [303]:
df_miss_1.Embarked.mode()[0]

'S'

In [308]:
df_miss_1.Embarked = df_miss_1.Embarked.fillna(df_miss_1.Embarked.mode()[0]) 
# Mode ile doldurmak daha mantıklıdır.

In [309]:
df_miss_1.Embarked.isnull().sum()

0

In [310]:
df_miss_1.Embarked.mode()[0]

'S'

## Fare'ın Doldurulması

In [311]:
df_miss_2 = df_missing.copy()

In [314]:
df_miss_2.Fare.mean(), df_miss_2.Fare.mode()[0], df_miss_2.Fare.median()

(31.844821874999965, 7.8958, 14.45625)

In [318]:
df_miss_2.Fare.head().mean(), df_miss_2.Fare.tail().mean()

(29.521660000000004, 20.1875)

In [321]:
df_miss_2.Fare = df_miss.Fare.fillna(df_miss_2.Fare.median())
# Alınan ortalama değer sonucu çok yüksek fiyata bilet almış kişiler tarafından veriyi manipüle etmektedir. Ortadaki değeri almak daha mantıklıdır.

In [322]:
df_miss_2.Fare.isnull().sum()

0

In [323]:
df_miss_2.Fare.mean(), df_miss_2.Fare.median(), df_miss_2.Fare.mode()[0]

(30.06888468013461, 14.45625, 14.45625)

# Soru 9

SibSp değişkeni hangi yöntemler ile doldurulabilir, fikir yürütün. Uygun bir yöntem ile doldurun. (SibSp değişkeni kişilerin gemide bulunan kardeş/eş sayısını belirtiyor.)

In [347]:
df_missing[["SibSp"]].head(15)

    SibSp
0     1.0
1     1.0
2     0.0
3     1.0
4     0.0
5     0.0
6     0.0
7     NaN
8     NaN
9     1.0
10    1.0
11    0.0
12    0.0
13    1.0
14    NaN

In [369]:
df_missing.SibSp.describe()

count    721.000000
mean       0.535368
std        1.140996
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        8.000000
Name: SibSp, dtype: float64

In [348]:
df_missing.SibSp.isnull().sum()

170

In [467]:
print("Bu kolon sıfır ile doldurulabilir. Kolonun describe metoduna bakıldığında, doldurulacak olan verinin sıfır olması mantıklıdır. Çünkü ortalama değeri de zaten sıfıra çok yakındır.")

Bu kolon sıfır ile doldurulabilir. Kolonun describe metoduna bakıldığında, doldurulacak olan verinin sıfır olması mantıklıdır. Çünkü ortalama değeri de zaten sıfıra çok yakındır.

In [360]:
df_missing[["SibSp"]].fillna(0).head(15)

    SibSp
0     1.0
1     1.0
2     0.0
3     1.0
4     0.0
5     0.0
6     0.0
7     0.0
8     0.0
9     1.0
10    1.0
11    0.0
12    0.0
13    1.0
14    0.0

# Soru 10

Datayı baştan okuyun. Embarked değişkenini "NAN" şeklinde yeni bir kategorisi olacak şekilde doldurun.

In [365]:
df_missing_2 = pd.read_csv("Desktop/Ödev/Ödev/train_missing.csv")
df_missing_2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

In [367]:
df_missing_2.Embarked.fillna("NaN", inplace=True)
display(df_missing)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

# Soru 11

"Fare" değişkeni için "Fare_Missing" adında yeni bir değişken türetip "Fare" değişkenini median ile doldurun.

In [397]:
df_missing_3 = df_missing.copy()
df_missing_3
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,NaN,Q

In [408]:
bos_indis = df_missing_3[df_missing_3.Fare.isnull()].index
bos_indis

Int64Index([ 11,  12,  17,  35,  40,  45,  67,  69,  70,  97, 105, 113, 129,
            162, 166, 175, 181, 182, 193, 206, 210, 215, 229, 255, 264, 267,
            283, 296, 301, 308, 324, 332, 354, 390, 396, 404, 413, 417, 427,
            430, 436, 437, 438, 440, 443, 456, 463, 490, 494, 504, 533, 562,
            589, 596, 599, 608, 614, 617, 618, 627, 654, 659, 676, 679, 681,
            684, 690, 695, 721, 722, 729, 748, 752, 757, 763, 773, 781, 783,
            790, 794, 798, 806, 808, 822, 823, 825, 841, 863, 872, 885, 888],
           dtype='int64')

In [404]:
df_missing_3.insert(10, "Fare_Missing", 0)
display(df_missing_3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Fare_Missing,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,0,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,0,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,0,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,0,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.0000,0,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.0000,0,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,NaN,0,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.0000,0,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.7500,0,NaN,Q

In [433]:
df_missing_3.Fare = df_missing_3.Fare.fillna(value = df_missing_3.Fare.median()) # Fare değişkenini median ile doldurdum.

In [422]:
df_missing_3.Fare.median()

14.45625

In [438]:
df_missing_3.loc[bos_indis, "Fare_Missing"] = 1 #Boş Fare_Missing değerlerini 1 ile doldurdum.
df_missing_3

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Fare_Missing,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.25000,0.0,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.28330,0.0,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.92500,0.0,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.10000,0.0,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.05000,0.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0.0,0,211536,13.00000,0.0,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0.0,0,112053,30.00000,0.0,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1.0,2,W./C. 6607,14.45625,1.0,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0.0,0,111369,30.00000,0.0,C148,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0.0,0,370376,7.75000,0.0,NaN,Q